app/controllers/application_controller.rb

  def set_company
    if request.subdomain.present? && request.domain == APP_HOST
      Company.current_tenant = Company.find_by(subdomain: request.subdomain)
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`subdomain` = 'asad01' LIMIT 1